## Plan Result (cftptl - Job)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.search_contributor_hmcts_way
  * azurerm_role_assignment.storage_blob_data_contributor_hmcts_way




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.search_contributor_hmcts_way will be created
  + resource "azurerm_role_assignment" "search_contributor_hmcts_way" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/servicePrincipals/29703cf0-15f5-411c-be38-425663df214b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Service Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Search/searchServices/platops-slack-help-bot-ptl"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_contributor_hmcts_way will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor_hmcts_way" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/servicePrincipals/29703cf0-15f5-411c-be38-425663df214b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Storage/storageAccounts/platopslackhelpbotai"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":478,"Program":"tfcmt","SHA1":"","Target":"cftptl - Job","Vars":{}} -->